package gr.aueb.cf.ch4;

/**
 * Αυτή η κλάση εμφανίζει όλους τους άρτιους αριθμούς από το 1 έως το 20.
 * Χρησιμοποιεί έναν βρόχο for για να διατρέξει τους αριθμούς και ελέγχει
 * αν κάθε αριθμός είναι άρτιος χρησιμοποιώντας τον τελεστή υπολοίπου (%).
 * Εάν ο αριθμός είναι άρτιος (δηλαδή το υπόλοιπο της διαίρεσης με το 2 είναι 0),
 * τότε εμφανίζεται στην έξοδο.
 *
 * @author A.Polymeros
 */
public class EvenNumbers {
    public static void main(String[] args) {
        for (int i = 1; i <= 20 ; i++) {
            if (i%2 == 0){
                System.out.print(i + " ");
            }
        }
    }
}
