package gr.aueb.cf.ch4;


/**
 * Αυτή η κλάση υπολογίζει το άθροισμα όλων των ακεραίων αριθμών από το 1 έως το 50.
 * Χρησιμοποιεί έναν βρόχο for για να διατρέξει τους αριθμούς και προσθέτει κάθε αριθμό
 * σε μια μεταβλητή συσσώρευσης (sum). Στο τέλος, εμφανίζει το συνολικό άθροισμα
 * στην κονσόλα με ένα επεξηγηματικό μήνυμα στα Ελληνικά.
 *
 * @author A.Polymeros
 */
public class IntSum {
    public static void main(String[] args) {
        int max = 50;
        int sum = 0;

        for (int i =1; i <= max ; i++) {
            sum+=i;
        }
        System.out.println("Το άθροισμα όλων των ακεραίων μέχρι το 50 ειναι:" + sum);
    }
}
