package gr.aueb.cf.ch4;
import java.util.Scanner;

/**
 * Το πρόγραμμα εκτυπώνει μία πυραμίδα από αστεράκια όπου τον αριθμό
 * των γραμμών της εισάγει ο χρήστης.
 * Ο αλγόριθμος λειτουργεί ως εξής:
 * 1. Καθορίζει το συνολικό αριθμό γραμμών (n)
 * 2. Υπολογίζει το συνολικό αριθμό στηλών (k) ως (2*n)-1, που είναι πάντα περιττός αριθμός
 * 3. Εντοπίζει τη "μεσαία" στήλη (m) ως (k+1)/2
 * 4. Χρησιμοποιεί δυο εμφωλιασμένους για να διατρέξει γραμμές και στήλες.
 * 5. Σε κάθε θέση εκτυπώνει:
 *     - Ένα κενό, αν η στήλη j είναι μικρότερη από m-i ή μεγαλύτερη από m+i
 *     - Έναν αστερίσκο (*) σε κάθε άλλη περίπτωση
 * @author Alexandros Polymeros
 */

public class StarPyramid {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        int n = 0;

        System.out.println("Παρακαλώ δώστε τον ακέραιο αριθμό των γραμμών της πυραμίδας:");
        n = scanner.nextInt();
        int k = (2*n)-1;//συνολο στηλών(περιττός)
        int m = (k+1)/2;//"μεσαία" στήλη

        for (int i = 0; i<n; i++) {
            for (int j = 1; j <=k ; j++) {
                //m-i---> κάτω όριο , m+i---> ανω όριο
                if(j<m-i || j>m+i){
                    System.out.print(" ");
                } else {
                    System.out.print("*");
                }
            }
            System.out.println();
        }
    }
}



