package gr.aueb.cf.ch5;
import java.util.Scanner;

/**
 * Η κλάση FindMax υλοποιεί μια εφαρμογή που βρίσκει τον μέγιστο από τρεις ακέραιους αριθμούς.
 * Η εφαρμογή ζητά από τον χρήστη να εισάγει τρεις ακέραιους αριθμούς, συγκρίνει τις τιμές
 * και εμφανίζει τον μεγαλύτερο από τους τρεις.
 *
 * Ο υπολογισμός του μέγιστου γίνεται με χρήση της μεθόδου Math.max() της Java.
 *
 * @author A.POLYMEROS
 * @version 1.0
 */
public class FindMax {
    static Scanner scanner = new Scanner(System.in);

    /**
     * Η κύρια μέθοδος της εφαρμογής. Προτρέπει τον χρήστη να εισάγει τρεις ακέραιους αριθμούς,
     * λαμβάνει τους αριθμούς και καλεί τη μέθοδο findMax για τον υπολογισμό του μέγιστου.
     * Στη συνέχεια, εμφανίζει τους τρεις αριθμούς και τον μέγιστο από αυτούς.
     *
     * @param args Παράμετροι γραμμής εντολών (δεν χρησιμοποιούνται)
     */
    public static void main(String[] args) {
        int x = 0;
        int y = 0;
        int z = 0;
        System.out.println("Παρακαλώ εισάγετε 3 ακεραίους αριθμούς:");
        x = getOneInt();
        y = getOneInt();
        z = getOneInt();

        System.out.printf("Ο μεγαλύτερος από τους %d, %d, %d είναι ο: %d",x ,y ,z, findMax(x,y,z));
    }

    /**
     * Διαβάζει και επιστρέφει έναν ακέραιο αριθμό από την είσοδο του χρήστη.
     *
     * @return Ο ακέραιος αριθμός που εισήγαγε ο χρήστης
     */
    public static int getOneInt(){
        return scanner.nextInt();
    }

    /**
     * Βρίσκει τον μέγιστο από τρεις ακέραιους αριθμούς.
     * Η μέθοδος χρησιμοποιεί την ενσωματωμένη μέθοδο Math.max() για να συγκρίνει
     * πρώτα τους δύο πρώτους αριθμούς x και y, και στη συνέχεια συγκρίνει το αποτέλεσμα
     * με τον τρίτο αριθμό z.
     *
     * @param x Ο πρώτος ακέραιος αριθμός προς σύγκριση
     * @param y Ο δεύτερος ακέραιος αριθμός προς σύγκριση
     * @param z Ο τρίτος ακέραιος αριθμός προς σύγκριση
     * @return Ο μέγιστος από τους τρεις ακέραιους αριθμούς
     */
    public static int findMax(int x, int y, int z){
        int max = 0;
        return max = Math.max(Math.max(x,y) ,z);
    }
}
